Repository: ahmedMetwaly/eagle_valet_parking_mobile
Catalog: lib/l10n/intl_*.arb
Languages: ar

# goodMorning
source: Good morninig
ar: صباح الخير

source: Hello
ar: أهلا

source: Skip
ar: تخطى

source: Done
ar: تم

source: Wrong
ar: خطأ

# noRoute
source: No Page Found
ar: الصفحة غير موجودة

source: No Route Body
ar: الصفحة غير موجودة

source: Log In
ar: تسجيل الدخول

# forgotPassword
source: Forget Password
ar: هل نسيت كلمة المرور

# loginWithSocialMedia
source: Or login with
ar: أو تسجيل الدخول بواسطة

source: Sign up
ar: إنشاء حساب

source: Required Field
ar: مطلوب

source: Not Valid Name
ar: لا يجب ان تحتوى على أرقام

source: Name
ar: الاسم

source: User name
ar: اسم المستخدم

source: National id
ar: الرقم القومى

# haveAccoount
source: Already have an accoount
ar: لدي حساب بالفعل

# signUpWithSc
source: Signup with social media
ar: إنشاء حساب بواسطة

# notValidEmail
source: Please enter valid email
ar: من فضلك، ادخل البريد الالكترونى صحيح

source: Email
ar: حساب

source: Password
ar: كلمة السر

# passErrorSignUp
source: Use 8 characters or more for your password
ar: استخدم 8 أحرف أو أكثر في كلمة المرور الخاصة بك

# onboarding1Title
source: Welcome to the News App
ar: اهلا بك فى تطبيق News

# onboarding1Body
source: Stay ahead of the curve with News! Personalize your news feed, receive breaking news alerts, and explore a world of information at your fingertips
ar: ابق في الصدارة مع News! خصص موجز الأخبار الخاص بك، واحصل على تنبيهات الأخبار العاجلة، واستكشف عالمًا من المعلومات بين يديك.

# onboarding2Title
source: Explore the World of News
ar: استكشف عالم الأخبار

# onboarding2Body
source: Customize your news experience by choosing your favorite topics. From global events to niche interests, our app covers it all.
ar: خصّص تجربة الأخبار الخاصة بك باختيار المواضيع المفضلة لديك. بدءًا من الأحداث العالمية وصولًا إلى الاهتمامات المتخصصة، يغطي تطبيقنا كل شيء.

# onboarding3Title
source: Stay Informed, Anywhere
ar: ابق مُطلعًا، أينما كنت

# onboarding3Body
source: Access breaking news and save articles. Share and discuss with your community, and dive into a world of knowledge on the go.
ar: احصل على آخر الأخبار واحفظ المقالات. شاركها وناقشها مع مجتمعك، واغوص في عالم المعرفة أثناء التنقل.

# discover
source: Discover Hotest News
ar: اكتشف أحدث الأخبار

source: Home
ar: الصفحة الرئيسية

source: Search
ar: بحث

source: Delete
ar: حذف

source: Confirm Delete
ar: تأكيد الحذف

# deleteContent
source: Do you want to delete this item ?
ar: هل تريد حذف هذا العنصر؟

source: No History
ar: لا يوجد سجل

source: History
ar: السجل

# noFavorite
source: You don't have a favorite yet!
ar: ليس لديك مفضل حتى الآن!

source: Profile
ar: الملف الشخصي

# searchHint
source: Search article, topic, writer
ar: بحث المقال، الموضوع، الكاتب

source: Select Language
ar: أختر اللغة

# trend
source: Trending topic today
ar: موضوعات رائجة اليوم

source: Go To Link
ar: انتقل إلى الرابط

source: By
ar: بواسطة

source: My Profile
ar: ملفي الشخصي

source: Language
ar: اللغة

# enLang
source: English
ar: الإنجليزية

# arLang
source: Arabic
ar: العربية

source: Log Out
ar: تسجيل الخروج

source: Search Result
ar: نتيجة البحث

source: Guest
ar: ضيف

# emailErrorSignUp
source: Email already exist try sign up with another email.
ar: البريد الإلكتروني موجود بالفعل، جرب التسجيل ببريد إلكتروني آخر.

source: Error
ar: خطأ

source: Ok
ar: موافق

source: Cancel
ar: إلغاء

source: Submit
ar: موافق

source: Phone Number
ar: رقم الهاتف

# userError
source: User name not found!
ar: لم يتم العثور على اسم المستخدم!

source: Email not found
ar: البريد الإلكتروني غير موجود

# loginError
source: The email or password is not correct
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# noUser
source: The email or password is not correct
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# wrongPass
source: Wrong password provided for that user.
ar: تم توفير كلمة مرور خاطئة لذلك المستخدم.

# loginAlertTitle
source: You are logout
ar: أنت خارج

# loginAlertText
source: Please login to add this item to favorite.
ar: يرجى تسجيل الدخول لإضافة هذا العنصر إلى المفضلة.

source: Register
ar: تسجيل

# continueAsGuest
source: OR continue as a
ar: أو المتابعة كـ

source: Don't have account?
ar: ليس لديك حساب؟

# exit
source: Press back again to exit
ar: اضغط للخلف مرة أخرى للخروج

# clear
source: Delete all items
ar: حذف جميع العناصر

# noBack
source: No back history found
ar: لم يتم العثور على تاريخ للعودة

# noForward
source: No forward history found
ar: لم يتم العثور على سجل للأمام

source: Retry
ar: أعد المحاولة

# connectionError
source: Please check your internet connection
ar: يرجى التحقق من اتصالك بالإنترنت

source: Confirm
ar: تأكيد

# confirmPasssword
source: Confirm Password
ar: تأكيد كلمة المرور

# passwordReset
source: Password reset link sent to your email!
ar: تم إرسال رابط إعادة ضبط كلمة المرور إلى بريدك الإلكتروني!

# emailRequired
source: Please enter a valid email !
ar: من فضلك أدخل بريد إلكتروني صالح!

# forgotPasswordDetails
source: Don't worry sometimes people can forget too, enter your email and we will send you a password reset link.
ar: لا تقلق ، في بعض الأحيان يمكن للناس أن ينسوا أيضًا ، أدخل بريدك الإلكتروني وسنرسل لك رابط إعادة تعيين كلمة المرور.

# passwordResestDetails
source: Your accoount security is our priority ! we've sent you a secure link to safely change your password and keep your account protected.
ar: أمن حسابك هو أولويتنا! لقد أرسلنا لك رابطًا آمنًا لتغيير كلمة المرور بأمان والحفاظ على حسابك محميًا.

source: Resend email
ar: إعادة إرسال البريد الإلكتروني

# checkYourEmail
source: Password reset email sent check your account.
ar: تم إرسال بريد إلكتروني لإعادة ضبط كلمة المرور. تحقق من حسابك.

source: Sent
ar: أرسلت

source: Good afternoon
ar: مساء الخير

# goodEvening
source: Good evining
ar: مساء الخير

source: Confirm logout
ar: تأكيد تسجيل الخروج

# logoutDescription
source: Do you want to logout ?
ar: هل تريد تسجيل الخروج؟

source: Email verfication sent.
ar: لقد أرسل اليك بريد الكترونى للتحقق

# emailVerficationDescription
source: Email verfication sent check your email and click on the link then press done to login. if the email not sent to you please press on Resend email.
ar: تم إرسال رسالة التحقق بالبريد الإلكتروني. يرجى التحقق من بريدك الإلكتروني والنقر فوق الرابط ثم الضغط على تم للتسجيل الدخول. في حال لم يتم إرسال البريد الإلكتروني إليك ، يرجى الضغط على إعادة إرسال البريد الإلكتروني.

# errorToManyRequests
source: You made too many requests within a window of time and have been rate limited. Back off for a while
ar: لقد تجاوزت عدد الطلبات المسموح بها خلال فترة زمنية قصيرة. تم تقييد المعدل مؤقتًا. يرجى المحاولة مرة أخرى بعد قليل.

# serverError
source: Something went wrong on our side.
ar: حدث شئ خطأ بالرجاء المحاولة مرة أخرى

# articleCount
source: Articles 100+
ar: أكثر من 100+

# noConnection
source: No internet conncetion
ar: لا يوجد اتصال بالانترنت

source: User not found
ar: المستخدم غير موجود

# internetNotStable
source: The internet conncetion is not stable !
ar: الاتصال بالانترنت غير مستقر !

# unKnownError
source: An Error has occurred, please try again later !
ar: لقد حدث خطأ يرجى المحاولة مرة أخرى لاحقا !

source: OR
ar: أو

# createAccount
source: Create accoount
ar: عمل حساب

source: Settings
ar: الاعدادات

source: Find place
ar: أوجد مكان

source: Please wait
ar: من فضلك انتظر

source: Select place
ar: حدد المكان

source: place is not in area
ar: المكان غير موجود بالمنطقة

source: Your address
ar: عنوانك

# alreadyHaveAccoount
source: Already have an account
ar: لديك بالفعل حساب الكترونى

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: إبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: Add new parking
ar: اضافة جراج جديد

source: Available parking
ar: الجراجات المتاحة

source: Parking information
ar: معلومات عن الجراج

source: Parking name
ar: اسم الجراج

# capacity
source: Parking capacity
ar: سعة الجراج

source: Parking fee
ar: رسوم وقوف السيارات

# addNewEmployer
source: Add new employee
ar: إضافة موظف جديد

# firstEmployer
source: First employee
ar: الموظف الأول

# addEmployers
source: Add employees
ar: إضافة الموظفين

source: Edit employees
ar: تعديل الموظفين

source: Add parking
ar: إضافة الجراج

# totalCustomersOfToday
source: Number of customers
ar: عدد العملاء

source: Live overview
ar: نظرة عامة مباشرة

source: Total
ar: الاجمالى

source: Total income
ar: اجمالى الدخل

# currency
source: EGP
ar: جنيها

source: This parking is still closing
ar: هذا الجراج مازال مغلقاَ

# transactionOf
source: Transaction in
ar: المعاملات فى شهر

source: Select month
ar: اختر الشهر

source: All months
ar: كل الأشهر

source: View details
ar: اظهر التفاصيل

# monthError
source: This month is currently unavailable
ar: هذا الشهر غير متاح حالياَ

# document_does_not_exist
source: Parking does not exist
ar: الجراج غير متوفر

source: Tickets
ar: التذاكر

# ticketNo
source: Ticket number
ar: رقم التذكر

source: Enter time
ar: وقت االدخول

source: Leave time
ar: وقت الخروج

source: Duration
ar: المدة

source: Still inside
ar: مازال بالداخل

source: Compare between parkings
ar: المقارنة ما بين الجراجات

source: Sales
ar: المبياعات

source: Edit name
ar: تعديل الاسم

source: Change password
ar: تغير كلمة المرور

source: Save
ar: احفظ

source: Camera
ar: كاميرا

source: Gallery
ar: معرض الصور

source: Edit
ar: تعديل

# employer
source: Employee
ar: موظف

source: Edit profile
ar: تعديل الملف الشخصى

# editSnackBar
source: Please fill all fields and must have at least 1 employee
ar: من فضلك ادخل جميع البيانات و لابد من ان يكون على الأقل 1 موظف

# delete_employer_message
source: Are you sure you want to delete this employee?
ar: هل تريد بالفعل حذف هذا الموظف؟

# employers
source: Employees
ar: الموظفين

source: Updating
ar: جارى التحديث

# employersAddedSucss
source: Employees added successfully
ar: إضافة الموظفين بنجاح

# employerEditSuccess
source: Employee data edited successfully
ar: تم تعديل بينات الموظف بنجاح

# showEmployers
source: Display employeees data
ar: عرض بينات الموظفين

source: Delete this parking
ar: جارى حذف الجراج

source: Parking deleted successfully
ar: تم حذف الجراج بنجاح

# addingNewParking
source: Adding new parking in progress
ar: جارى إضافة جراج جديد

source: Deleting in progress
ar: جارى الحذف

# gettingParkingsData
source: Getting parkings data in progress
ar: جارى الحصول على بيانات الجراجات

source: Updating data in progress
ar: جارى تحديث البيانات

# addingNewEmployers
source: Adding new employees
ar: جارى إضافة موظفين جدد

# gettingEmployersData
source: Getting employees data
ar: جارى تحميل بيانات الموظفين

# enterValidNationalId
source: National ID must be 14 digits
ar: الرقم القومى لابد ان يكون 14 رقم

# nationalIdError
source: National ID must cantaions only digits
ar: الرقم القومى لابد ان يكون 14 رقم

source: Hours
ar: ساعة

source: Minutes
ar: دقيقة

# totalCustomer
source: Total numbers of customers
ar: إجمالى عدد العملاء
